export const sliderData = [
  {
    id: 1,
    title: 'Отображение данных о компаниях с сервера',
    desc: 'Пользователь попадает на экран со списком карт компаний. Каждая компания имеет свою историю рейтинга, бонусов, кешбэка,',
  },
  {
    id: 2,
    title: 'Подгрузка данных с сервера',
    desc: 'Карты компаний подгружаются порциями с сервера с использованием параметров offset (текущее суммарное количество загруженных карт) и limit (запрашиваемое количество карт).',
  },
  {
    id: 3,
    title: 'Интерактивность карточек компаний',
    desc: 'На каждой карте компании присутствуют три кнопки: "Подробнее", "Показать", "Удалить". При нажатии на них появляется всплывающее окно с текстом и идентификатором компании, который получается с сервера.',
  },
  {
    id: 4,
    title: 'Интерактивность экранов',
    desc: 'При первом запуске приложения отображается начальный экран с логотипом компании, а затем показывается экран с прелоудером. Если карты компаний отсутствуют, показывается текст, сообщающий об этом. При подгрузке новых данных внизу экрана отображается прелоудер.',
  },
  {
    id: 5,
    title: 'Динамические цвета карточек компаний',
    desc: 'Цвета фона и элементов на карте компании устанавливаются динамически в соответствии с данными с сервера.',
  },
  {
    id: 6,
    title: 'Обработка ошибок',
    desc: 'typesOfRequests',
  },
  {
    id: 7,
    title: 'При запросах к серверу обрабатываются различные ошибки:',
    desc: 'infoErrorsDesc',
  },
  {
    id: 8,
    title: 'Техническая составляющая',
    desc: 'В проекте использовал: HTML, CSS, JavaScript и библиотеку React. В управлении состоянием использовал Redux, Redux Thunck. Также использовал сборщик Vite ',
  },
]
